Table of Contents
 Class ReinfBarByPolyline
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representing reinforcement bar input by polyline in IDEA StatiCa Detail
[OpenModelClass(typeof(Reinforcement))]
public class ReinfBarByPolyline : ReinforcementGroup
Inheritance
object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
ReinfBarByPolyline
Inherited Members
 ReinforcementGroup.Diameter
 ReinforcementGroup.NumOfBarsInLayer
 ReinforcementGroup.CoverFromSetting
 ReinforcementGroup.Cover
 ReinforcementGroup.EndsTypeBeg
 ReinforcementGroup.EndsTypeEnd
 ReinforcementGroup.DiameterOfMandrel
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ReinfBarByPolyline()
Constructor
public ReinfBarByPolyline()
Properties
 BarDistance
Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
public Vector3D BarDistance { get; set; }
Property Value
Vector3D
 BarShape
Polyline representing shape of bar
public ReferenceElement BarShape { get; set; }
Property Value
ReferenceElement
 Distance
Distance between reinforcement layers
public double Distance { get; set; }
Property Value
double
 MasterComponent
Master component of reinforcement
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 MasterPoint
Master point of reinforcement
public int MasterPoint { get; set; }
Property Value
int
 NumOfLayers
Number of layers
public int NumOfLayers { get; set; }
Property Value
int
 Position
Offset between master point and first point of BarShape
public Vector3D Position { get; set; }
Property Value
Vector3D
 Edit this page